code-review/NRB_3471_3546/База_Стало/Catalogs/КодыЗагрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>КодыЗагрузки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Catalog.МестаХранения</xr:Item>
				<xr:Item>Catalog.СчетаДепо</xr:Item>
				<xr:Item>Catalog.СчетаДепоМХ</xr:Item>
				<xr:Item>Catalog.ФизическиеЛица</xr:Item>
				<xr:Item>Catalog.ЦенныеБумаги</xr:Item>
				<xr:Item>Catalog.ЮридическиеЛица</xr:Item>
				<xr:Item>Catalog.Организации</xr:Item>
				<xr:Item>Catalog.ГруппаЦБДляНалогообложения</xr:Item>
				<xr:Item>Catalog.ТипыНалогов</xr:Item>
				<xr:Item>Catalog.Субклиенты</xr:Item>
				<xr:Item>Catalog.ТарифныеПланы</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Биржа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторыЗагрузки</v8:Type>
						<v8:Type>cfg:CatalogRef.Биржи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Catalogs/КодыЗагрузки/Ext/ManagerModule.bsl
Функция НайтиПоВладельцуИБирже(Владелец, Биржа, ДатаОкончанияДействия = Неопределено) Экспорт
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КодыЗагрузки.Ссылка КАК КодЗагрузки
	|ИЗ
	|	Справочник.КодыЗагрузки КАК КодыЗагрузки
	|ГДЕ
	|	КодыЗагрузки.Владелец = &Владелец
	|	И КодыЗагрузки.Биржа = &Биржа
	|	И &УсловиеПоДате
	|	И НЕ КодыЗагрузки.ПометкаУдаления
	|
	|ДЛЯ ИЗМЕНЕНИЯ
	|	Справочник.КодыЗагрузки");
	Если ДатаОкончанияДействия = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоДате", "Истина");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоДате",
			"(КодыЗагрузки.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
			|ИЛИ КодыЗагрузки.ДатаОкончанияДействия > &ДатаОкончанияДействия )");
	КонецЕсли;
	Запрос.УстановитьПараметр("Владелец", Владелец);	
	Запрос.УстановитьПараметр("Биржа", Биржа);	
	Запрос.УстановитьПараметр("ДатаОкончанияДействия", ДатаОкончанияДействия);	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.КодЗагрузки;
	Иначе
		Возврат Справочники.КодыЗагрузки.ПустаяСсылка();
	КонецЕсли;
КонецФункции

// Получить элемент справочника по всем параметрам: владельцу, классификатору, коду и дате
// Параметры:
//  Владелец - Ссылка - Ссылка на владельца кода загрузки
//  Классификатор - Ссылка - Ссылка на классификатор кода или биржу
//  Код - Строка - Код загрузки строкой
//  ДатаОкончанияДействия - Дата - Дата, на которую ищем активный код
// Возвращаемое значение:
//   - Ссылка - Результат поиска кода загрузки
Функция СсылкаПоВладельцуКлассификаторуКоду(Владелец, Классификатор, Код, ДатаОкончанияДействия = Неопределено) Экспорт
	
	Если ДатаОкончанияДействия = Неопределено Тогда
		ДатаОкончанияДействия = ТекущаяДатаСеанса();
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КодыЗагрузки.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КодыЗагрузки КАК КодыЗагрузки
	|ГДЕ
	|	КодыЗагрузки.Код = &Идентификатор
	|	И НЕ КодыЗагрузки.ПометкаУдаления
	|	И (КодыЗагрузки.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ КодыЗагрузки.ДатаОкончанияДействия > &ТекущаяДата)
	|	И КодыЗагрузки.Владелец = &Ссылка
	|	И КодыЗагрузки.Биржа = &Классификатор";
	Запрос.УстановитьПараметр("Идентификатор", Код);
	Запрос.УстановитьПараметр("Ссылка", Владелец);
	Запрос.УстановитьПараметр("Классификатор", Классификатор);
	Запрос.УстановитьПараметр("ТекущаяДата", НачалоДня(ДатаОкончанияДействия));
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Ссылка;
	КонецЕсли;
КонецФункции

// Получить ссылку на владельца кода загрузки
// Параметры:
//  КодЗагрузки - Строка - Код загрузки строкой
//  ТипКода - Ссылка - Ссылка на тип кода
//  Дата - Дата - Дата на которую выбирается значение
// Возвращаемое значение:
//   - Ссылка - Ссылка на владельца кода загрузки
Функция ВладелецКода(КодЗагрузки, ТипКода, Дата = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(КодЗагрузки) Или Не ЗначениеЗаполнено(ТипКода) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Дата = Неопределено Тогда
		Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КодыЗагрузки.Владелец КАК Владелец
	|ИЗ
	|	Справочник.КодыЗагрузки КАК КодыЗагрузки
	|ГДЕ
	|	КодыЗагрузки.Биржа = &ТипКода
	|	И КодыЗагрузки.Код = &Код
	|	И НЕ КодыЗагрузки.ПометкаУдаления
	|	И ВЫБОР
	|			КОГДА КодыЗагрузки.ДатаНачалаДействия <= &ТекущаяДата
	|				ТОГДА ИСТИНА
	|			КОГДА КодыЗагрузки.ДатаНачалаДействия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА КодыЗагрузки.ДатаОкончанияДействия > &ТекущаяДата
	|				ТОГДА ИСТИНА
	|			КОГДА КодыЗагрузки.ДатаНачалаДействия = ДАТАВРЕМЯ(1, 1, 1)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ";
	Запрос.УстановитьПараметр("ТипКода", ТипКода);
	ТекстКодЗагрузки = СокрЛП(СтрЗаменить(КодЗагрузки, Символы.НПП, ""));
	Запрос.УстановитьПараметр("Код", ТекстКодЗагрузки);
	Запрос.УстановитьПараметр("ТекущаяДата", Дата);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Владелец = Выборка.Владелец;
	Иначе
		Владелец = Неопределено;
	КонецЕсли;
	
	Возврат Владелец;
КонецФункции
